_docs/worklog/attachments/2026-07-10_phase1a-after-harness/20260710-phase1a-after-164626/after_random_r30/k6_stdout.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: k6/http/rtb-decision-random-pool.js
        output: -

     scenarios: (100.00%) 1 scenario, 240 max VUs, 1m30s max duration (incl. graceful stop):
              * rtb_decision: 30.00 iterations/s for 1m0s (maxVUs: 50-240, gracefulStop: 30s)


running (0m01.0s), 019/050 VUs, 11 complete and 0 interrupted iterations
rtb_decision   [   2% ] 019/050 VUs  0m01.0s/1m0s  30.00 iters/s

running (0m02.0s), 000/050 VUs, 60 complete and 0 interrupted iterations
rtb_decision   [   3% ] 000/050 VUs  0m02.0s/1m0s  30.00 iters/s

running (0m03.0s), 000/050 VUs, 90 complete and 0 interrupted iterations
rtb_decision   [   5% ] 000/050 VUs  0m03.0s/1m0s  30.00 iters/s

running (0m04.0s), 000/050 VUs, 120 complete and 0 interrupted iterations
rtb_decision   [   7% ] 000/050 VUs  0m04.0s/1m0s  30.00 iters/s

running (0m05.0s), 003/050 VUs, 147 complete and 0 interrupted iterations
rtb_decision   [   8% ] 003/050 VUs  0m05.0s/1m0s  30.00 iters/s

running (0m06.0s), 010/050 VUs, 170 complete and 0 interrupted iterations
rtb_decision   [  10% ] 010/050 VUs  0m06.0s/1m0s  30.00 iters/s

running (0m07.0s), 000/050 VUs, 210 complete and 0 interrupted iterations
rtb_decision   [  12% ] 000/050 VUs  0m07.0s/1m0s  30.00 iters/s

running (0m08.0s), 004/050 VUs, 236 complete and 0 interrupted iterations
rtb_decision   [  13% ] 004/050 VUs  0m08.0s/1m0s  30.00 iters/s

running (0m09.0s), 009/050 VUs, 261 complete and 0 interrupted iterations
rtb_decision   [  15% ] 009/050 VUs  0m09.0s/1m0s  30.00 iters/s

running (0m10.0s), 023/050 VUs, 277 complete and 0 interrupted iterations
rtb_decision   [  17% ] 023/050 VUs  0m10.0s/1m0s  30.00 iters/s

running (0m11.0s), 029/050 VUs, 301 complete and 0 interrupted iterations
rtb_decision   [  18% ] 029/050 VUs  0m11.0s/1m0s  30.00 iters/s

running (0m12.0s), 017/050 VUs, 343 complete and 0 interrupted iterations
rtb_decision   [  20% ] 017/050 VUs  0m12.0s/1m0s  30.00 iters/s

running (0m13.0s), 019/050 VUs, 371 complete and 0 interrupted iterations
rtb_decision   [  22% ] 019/050 VUs  0m13.0s/1m0s  30.00 iters/s

running (0m14.0s), 004/050 VUs, 416 complete and 0 interrupted iterations
rtb_decision   [  23% ] 004/050 VUs  0m14.0s/1m0s  30.00 iters/s

running (0m15.0s), 010/050 VUs, 440 complete and 0 interrupted iterations
rtb_decision   [  25% ] 010/050 VUs  0m15.0s/1m0s  30.00 iters/s

running (0m16.0s), 007/050 VUs, 473 complete and 0 interrupted iterations
rtb_decision   [  27% ] 007/050 VUs  0m16.0s/1m0s  30.00 iters/s

running (0m17.0s), 000/050 VUs, 510 complete and 0 interrupted iterations
rtb_decision   [  28% ] 000/050 VUs  0m17.0s/1m0s  30.00 iters/s

running (0m18.0s), 000/050 VUs, 540 complete and 0 interrupted iterations
rtb_decision   [  30% ] 000/050 VUs  0m18.0s/1m0s  30.00 iters/s

running (0m19.0s), 000/050 VUs, 570 complete and 0 interrupted iterations
rtb_decision   [  32% ] 000/050 VUs  0m19.0s/1m0s  30.00 iters/s

running (0m20.0s), 000/050 VUs, 600 complete and 0 interrupted iterations
rtb_decision   [  33% ] 000/050 VUs  0m20.0s/1m0s  30.00 iters/s

running (0m21.0s), 000/050 VUs, 630 complete and 0 interrupted iterations
rtb_decision   [  35% ] 000/050 VUs  0m21.0s/1m0s  30.00 iters/s

running (0m22.0s), 000/050 VUs, 660 complete and 0 interrupted iterations
rtb_decision   [  37% ] 000/050 VUs  0m22.0s/1m0s  30.00 iters/s

running (0m23.0s), 000/050 VUs, 690 complete and 0 interrupted iterations
rtb_decision   [  38% ] 000/050 VUs  0m23.0s/1m0s  30.00 iters/s

running (0m24.0s), 000/050 VUs, 720 complete and 0 interrupted iterations
rtb_decision   [  40% ] 000/050 VUs  0m24.0s/1m0s  30.00 iters/s

running (0m25.0s), 019/050 VUs, 731 complete and 0 interrupted iterations
rtb_decision   [  42% ] 019/050 VUs  0m25.0s/1m0s  30.00 iters/s

running (0m26.0s), 043/050 VUs, 737 complete and 0 interrupted iterations
rtb_decision   [  43% ] 043/050 VUs  0m26.0s/1m0s  30.00 iters/s

running (0m27.0s), 024/050 VUs, 786 complete and 0 interrupted iterations
rtb_decision   [  45% ] 024/050 VUs  0m27.0s/1m0s  30.00 iters/s

running (0m28.0s), 004/050 VUs, 836 complete and 0 interrupted iterations
rtb_decision   [  47% ] 004/050 VUs  0m28.0s/1m0s  30.00 iters/s

running (0m29.0s), 000/050 VUs, 870 complete and 0 interrupted iterations
rtb_decision   [  48% ] 000/050 VUs  0m29.0s/1m0s  30.00 iters/s

running (0m30.0s), 000/050 VUs, 900 complete and 0 interrupted iterations
rtb_decision   [  50% ] 000/050 VUs  0m30.0s/1m0s  30.00 iters/s

running (0m31.0s), 003/050 VUs, 927 complete and 0 interrupted iterations
rtb_decision   [  52% ] 003/050 VUs  0m31.0s/1m0s  30.00 iters/s

running (0m32.0s), 003/050 VUs, 957 complete and 0 interrupted iterations
rtb_decision   [  53% ] 003/050 VUs  0m32.0s/1m0s  30.00 iters/s

running (0m33.0s), 010/050 VUs, 980 complete and 0 interrupted iterations
rtb_decision   [  55% ] 010/050 VUs  0m33.0s/1m0s  30.00 iters/s

running (0m34.0s), 001/050 VUs, 1019 complete and 0 interrupted iterations
rtb_decision   [  57% ] 001/050 VUs  0m34.0s/1m0s  30.00 iters/s

running (0m35.0s), 005/050 VUs, 1045 complete and 0 interrupted iterations
rtb_decision   [  58% ] 005/050 VUs  0m35.0s/1m0s  30.00 iters/s

running (0m36.0s), 012/050 VUs, 1068 complete and 0 interrupted iterations
rtb_decision   [  60% ] 012/050 VUs  0m36.0s/1m0s  30.00 iters/s

running (0m37.0s), 000/050 VUs, 1110 complete and 0 interrupted iterations
rtb_decision   [  62% ] 000/050 VUs  0m37.0s/1m0s  30.00 iters/s

running (0m38.0s), 001/050 VUs, 1139 complete and 0 interrupted iterations
rtb_decision   [  63% ] 001/050 VUs  0m38.0s/1m0s  30.00 iters/s

running (0m39.0s), 000/050 VUs, 1170 complete and 0 interrupted iterations
rtb_decision   [  65% ] 000/050 VUs  0m39.0s/1m0s  30.00 iters/s

running (0m40.0s), 016/050 VUs, 1184 complete and 0 interrupted iterations
rtb_decision   [  67% ] 016/050 VUs  0m40.0s/1m0s  30.00 iters/s

running (0m41.0s), 022/050 VUs, 1208 complete and 0 interrupted iterations
rtb_decision   [  68% ] 022/050 VUs  0m41.0s/1m0s  30.00 iters/s

running (0m42.0s), 015/050 VUs, 1245 complete and 0 interrupted iterations
rtb_decision   [  70% ] 015/050 VUs  0m42.0s/1m0s  30.00 iters/s

running (0m43.0s), 024/050 VUs, 1266 complete and 0 interrupted iterations
rtb_decision   [  72% ] 024/050 VUs  0m43.0s/1m0s  30.00 iters/s

running (0m44.0s), 007/050 VUs, 1313 complete and 0 interrupted iterations
rtb_decision   [  73% ] 007/050 VUs  0m44.0s/1m0s  30.00 iters/s

running (0m45.0s), 004/050 VUs, 1346 complete and 0 interrupted iterations
rtb_decision   [  75% ] 004/050 VUs  0m45.0s/1m0s  30.00 iters/s

running (0m46.0s), 014/050 VUs, 1366 complete and 0 interrupted iterations
rtb_decision   [  77% ] 014/050 VUs  0m46.0s/1m0s  30.00 iters/s

running (0m47.0s), 000/050 VUs, 1410 complete and 0 interrupted iterations
rtb_decision   [  78% ] 000/050 VUs  0m47.0s/1m0s  30.00 iters/s

running (0m48.0s), 000/050 VUs, 1440 complete and 0 interrupted iterations
rtb_decision   [  80% ] 000/050 VUs  0m48.0s/1m0s  30.00 iters/s

running (0m49.0s), 000/050 VUs, 1470 complete and 0 interrupted iterations
rtb_decision   [  82% ] 000/050 VUs  0m49.0s/1m0s  30.00 iters/s

running (0m50.0s), 001/050 VUs, 1499 complete and 0 interrupted iterations
rtb_decision   [  83% ] 001/050 VUs  0m50.0s/1m0s  30.00 iters/s

running (0m51.0s), 007/050 VUs, 1523 complete and 0 interrupted iterations
rtb_decision   [  85% ] 007/050 VUs  0m51.0s/1m0s  30.00 iters/s

running (0m52.0s), 008/050 VUs, 1552 complete and 0 interrupted iterations
rtb_decision   [  87% ] 008/050 VUs  0m52.0s/1m0s  30.00 iters/s

running (0m53.0s), 011/050 VUs, 1579 complete and 0 interrupted iterations
rtb_decision   [  88% ] 011/050 VUs  0m53.0s/1m0s  30.00 iters/s

running (0m54.0s), 001/050 VUs, 1619 complete and 0 interrupted iterations
rtb_decision   [  90% ] 001/050 VUs  0m54.0s/1m0s  30.00 iters/s

running (0m55.0s), 022/050 VUs, 1628 complete and 0 interrupted iterations
rtb_decision   [  92% ] 022/050 VUs  0m55.0s/1m0s  30.00 iters/s

running (0m56.0s), 034/050 VUs, 1646 complete and 0 interrupted iterations
rtb_decision   [  93% ] 034/050 VUs  0m56.0s/1m0s  30.00 iters/s

running (0m57.0s), 056/056 VUs, 1648 complete and 0 interrupted iterations
rtb_decision   [  95% ] 056/056 VUs  0m57.0s/1m0s  30.00 iters/s

running (0m58.0s), 045/059 VUs, 1686 complete and 0 interrupted iterations
rtb_decision   [  97% ] 045/059 VUs  0m58.0s/1m0s  30.00 iters/s

running (0m59.0s), 004/059 VUs, 1757 complete and 0 interrupted iterations
rtb_decision   [  98% ] 004/059 VUs  0m59.0s/1m0s  30.00 iters/s

running (1m00.0s), 013/059 VUs, 1778 complete and 0 interrupted iterations
rtb_decision   [ 100% ] 013/059 VUs  1m00.0s/1m0s  30.00 iters/s


  █ THRESHOLDS 

    business_errors
    ✗ 'rate<0.01' rate=7.75%

    errors
    ✗ 'rate<0.01' rate=7.75%

    http_req_duration
    ✗ 'p(95)<300' p(95)=1.27s

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 3584   59.214705/s
    checks_succeeded...: 96.12% 3445 out of 3584
    checks_failed......: 3.87%  139 out of 3584

    ✓ decision: status is 2xx
    ✗ decision: business success
      ↳  92% — ✓ 1653 / ✗ 139

    CUSTOM
    business_error_reasons.........: 139    2.296552/s
    business_errors................: 7.75%  139 out of 1792
    business_success...............: 92.24% 1653 out of 1792
    decision_success_duration......: avg=345.41ms min=7.95ms med=192.91ms p(90)=852.28ms p(95)=1.31s p(99)=2.02s max=2.3s 
    errors.........................: 7.75%  139 out of 1792
    transport_errors...............: 0.00%  0 out of 1792

    HTTP
    http_req_duration..............: avg=336.46ms min=7.95ms med=185.51ms p(90)=837.14ms p(95)=1.27s p(99)=2s    max=2.3s 
      { expected_response:true }...: avg=336.46ms min=7.95ms med=185.51ms p(90)=837.14ms p(95)=1.27s p(99)=2s    max=2.3s 
    http_req_failed................: 0.00%  0 out of 1792
    http_reqs......................: 1792   29.607353/s

    EXECUTION
    dropped_iterations.............: 9      0.148698/s
    iteration_duration.............: avg=336.96ms min=8.18ms med=186.02ms p(90)=837.47ms p(95)=1.27s p(99)=2.02s max=2.31s
    iterations.....................: 1792   29.607353/s
    vus............................: 13     min=0            max=56
    vus_max........................: 59     min=50           max=59

    NETWORK
    data_received..................: 2.0 MB 32 kB/s
    data_sent......................: 571 kB 9.4 kB/s



running (1m00.5s), 000/059 VUs, 1792 complete and 0 interrupted iterations
rtb_decision ✓ [ 100% ] 000/059 VUs  1m0s  30.00 iters/s
time="2026-07-10T17:10:01+09:00" level=error msg="thresholds on metrics 'business_errors, errors, http_req_duration' have been crossed"